---

C#Visual BasicVisual C++

Include Protected MembersInclude Inherited Members

Revit 2024 API
---
SchedulableField Properties
SchedulableField Class See Also Send Feedback
---

The SchedulableField type exposes the following members.

# Properties

|  | Name | Description |
| --- | --- | --- |
|  | FieldType | The type of data displayed by the field. |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
|  | ParameterId | The ID of the parameter displayed by the field. |

# See Also

SchedulableField Class

Autodesk.Revit.DB Namespace